using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Text;
using System.Windows.Forms;

namespace Mouseio
{
    public partial class foreign_beaches : Mouseio.greek_beaches
    {

        public foreign_beaches(choice parent_form)
            : base(parent_form)
        {
            beaches = new Beach[] 
            {
                new Beach("Wineglass Bay - Αυστραλία",Mouseio.Properties.Resources.bay1,"Η παραλία «κρασοπότηρο» (λόγω σχήματος) είναι μία από τις πιο απομονωμένες του κόσμου, ενώ κατατάσσεται στα πιο όμορφα τοπία του πλανήτη λόγω εναλλαγής… χρωμάτων: λευκό για την άμμο, πρασινογάλαζο για το νερό και καταπράσινο για το μικρό δάσος που την περιβάλλει. Η διττή αυτή… φήμη της την καθιστά πρώτη στη λίστα των προτιμήσεων κυρίως για «ιδιωτικότητα» αλλά και για μια βουτιά στα κρυστάλλινα νερά, ενώ οι λάτρεις της πεζοπορίας θα τη λατρέψουν χωρίς αμφιβολία. Η Wineglass Bay βρίσκεται κοντά στο Χόμπαρτ, ένα νησί στο νότιο άκρο της Αυστραλίας, αποτελώντας για τους κατοίκους της Μελβούρνης (και όχι μόνο!) μια απόδραση στην περιπέτεια."),
                new Beach("Bay of Islands - Νέα Ζηλανδία",Mouseio.Properties.Resources.bay4,"Ολόκληρη η περιοχή Bay of Islands είναι ένας από τους πιο δημοφιλείς προορισμούς για διακοπές στη Νέα Ζηλανδία, και όχι μόνο. Και πώς αλλιώς, άλλωστε, αφού 144 καταπράσινα νησιά με πολλές αμμώδεις παραλίες συνθέτουν ένα κατά τα άλλα μαγευτικό φυσικό τοπίο, που κερδίζει αμέσως τις εντυπώσεις. Επιπλέον, ο ομώνυμος κόλπος παρουσιάζει μια… αφθονία θαλάσσιας ζωής, με φάλαινες, πιγκουίνους και δελφίνια να κάνουν διακριτικά την εμφάνισή τους κοντά στους λουόμενους!"),
                new Beach("Hanauma Bay - Χαβάη",Mouseio.Properties.Resources.bay5,"Όταν η θάλασσα εισχωρεί μέσα σε έναν ηφαιστειακό κώνο, τότε οι εικόνες μιλάνε από μόνες τους και τα λόγια είναι περιττά! Η απόκοσμη αυτή παραλία βρίσκεται κατά μήκος της νοτιοανατολικής ακτής του νησιού Οάχου (ανατολικά της Χονολουλού) της Χαβάης, αποτελώντας έναν από τους πιο δημοφιλείς τουριστικούς προορισμούς, φιλοξενώντας πάνω από τρία εκατομμύρια επισκέπτες ετησίως! Περίπου 400 είδη ψαριών ενδημούν στον κόλπο, με τα ασυνήθιστα ψάρια-παπαγάλους (parrotfish) να κυριαρχούν στη… λίστα, ενώ η Hanauma Bay είναι επίσης γνωστή για την αφθονία της πράσινης θαλάσσιας χελώνας, της διάσημης Honu, που ζει εκεί. Το τοπίο συμπληρώνουν κοραλλιογενείς ύφαλοι που εξέχουν από τη θάλασσα, αλλά και ψηλοί φοίνικες που φτάνουν μέχρι την ακτή."),
                new Beach("La Hong Bay - Bιετνάμ",Mouseio.Properties.Resources.bay7,"Ανήκει στη Λίστα της Παγκόσμιας Κληρονομιάς της UNESCO και βρίσκεται στην επαρχία Quang Ninh του Βιετνάμ. Ο κόλπος διαθέτει χιλιάδες βραχώδη νησιά σε διάφορα μεγέθη και σχήματα (πάνω από 3.000!) και είναι γνωστός για τις γεωλογικές και γεωμορφολογικές εναλλαγές του. H παραλία Ha Long Bay αποτελεί ένα από τα κρυφά-διαμάντια της περιοχής, καθώς η πυκνή βλάστηση φτάνει μέχρι τη θάλασσα και η «χρυσή» άμμος εκτείνεται σε αρκετά χιλιόμετρα. Πολλά από τα νησιά είναι «κούφια», σχηματίζοντας τεράστιες σπηλιές, δίνοντας την ευκαιρία στους επισκέπτες να θαυμάσουν ένα μοναδικό τοπίο."),
                new Beach("Ηanalei Bay - Χαβάη",Mouseio.Properties.Resources.bay9,"Μία από τις πλέον εντυπωσιακές παραλίες στη βόρεια ακτή του νησιού Kauai στη Χαβάη περιβάλλεται από βουνά και εκτείνεται περίπου τρία χιλιόμετρα σε μήκος. Δεσπόζει στο κέντρο ενός σχεδόν κυκλικού ομώνυμου κόλπου και διακρίνεται για τη λευκή άμμο και τα πρασινογάλαζα νερά, που υπόσχονται μια μοναδική υδάτινη εμπειρία. Σε ορισμένα, μάλιστα, σημεία το τοπίο γίνεται μαγικό, καθώς καταρράκτες καταλήγουν στη θάλασσα, καθιστώντας τη Hanalei Bay μία από τις πλέον πολυφωτογραφημένες ακτές της Χαβάης. Πλήθος ξενοδοχείων και τουριστικών εγκαταστάσεων προσφέρουν υψηλής ποιότητας διαμονή, για απαιτητικούς επισκέπτες."),
                new Beach("Villefranche Bay - Γαλλία ",Mouseio.Properties.Resources.bay10,"Βρίσκεται στην πρώτη θέση επιλογής για τους δύτες ανά τον κόσμο εξαιτίας του «πολυμορφικού» βυθού αλλά και του διάσημου ομώνυμου υδάτινου φαραγγιού που κρύβει στους κόλπους της, περίπου ένα ναυτικό μίλι από την ακτή. Πλούτος θαλάσσιας ζωής αλλά και εξαιρετική φυσική ομορφιά αποτελούν τα βασικά χαρακτηριστικά της παραλίας Villefranche Bay που γίνεται πόλος έλξης πολλών τουριστών κάθε χρόνο.")
            };

            InitializeComponent();
            initiliazeBeach();

        }
    }
}
